#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

// 像结构体一样,联合体也是由一个或多个成员构成,这些成员可以是不同的类型.联合体的关键字是union
// 但是编译器只为最大的成员分配足够的内存空间.联合体的特点是所有成员共用同一块内存空间.所以联合体也叫共用体
// 给联合体其中一个成员赋值,其他成员的值也跟着变化

// struct S
//{
//	int i;   //0偏移开始  0 1 2 3   //对齐数为4
//	char c;  //4                    //对齐数为1
//	//总共占5个字节,但是结构体的大小是最大对齐数的整数倍
//	//所以结构体的大小为8字节
// };
//
// union Un
//{
//	int i;
//	char c;
//	//联合体的成员是共用同一块内存空间的,这样一个联合变量的大小,至少是最大成员的大小
//	//(因为联合至少得有能力保存保存最大的那个成员)
// };
//
// int main()
//{
//	//printf("%zu\n", sizeof(struct S));//结构体的大小是8字节
//	printf("%zu\n", sizeof(union Un));//联合体的大小是4字节
//
//	union Un u;
//	printf("%p\n", &u);
//	printf("%p\n", &(u.c));
//	printf("%p\n", &(u.i));//这三个地址是一样的,说明共用一块内存空间
//
//
//	return 0;
// }

// union Un
//{
//	int i;
//	char c;
// };
//
//
//
// int main()
//{
//	union Un u = { 0 };
//	u.i = 0x11223344;
//	u.c = 0x55;
//
//	return 0;
// }

// 联合体的大小至少是最大成员的大小
// 当最大成员大小不是最大对齐数的整数倍的时候,就要对齐到最大对齐数的整数倍

// union Un1
//{
//	char c[5]; // 对齐数1
//	int i;	   // 对齐数4
// };
//
// union Un2
//{
//	short c[7]; // 对齐数2   7 * 2 = 14字节
//	int i;	    // 对齐数4
// };
//
//
// int main()
//{
//	printf("%zu\n", sizeof(union Un1)); // 8字节
//	printf("%zu\n", sizeof(union Un2)); // 16字节
//	return 0;
// }

// 判断大小端字节序
// 大端序:高位字节存放在低地址的内存中,低位字节存放在高地址的内存中
// 低地址 ---------> 高地址
// 0x12  0x34  0x56  0x78
// 小端序:低位字节存放在低地址的内存中,高位字节存放在高地址的内存中
// 低地址 ---------> 高地址
// 0x78  0x56  0x34  0x12
//  void check_sys()
//  {
//  	int a = 1; //00 00 00 01   01 00 00 00
//  	char *p = (char *)&a;
//  	if (*p == 1) //小端字节序
//  		printf("小端字节序\n");
//  	else
//  		printf("大端字节序\n");
//  }

// int check_sys()
// {
// 	union Un
// 	{
// 		char c;
// 		int i;
// 	} u;
// 	u.i = 1;
// 	return u.c; // 返回1,说明是小端字节序,否则就是大端字节序
// }

// int main()
// {
// 	if (check_sys() == 1)
// 		printf("小端字节序\n");
// 	else
// 		printf("大端字节序\n");

// 	return 0;
// }