#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//
// int main()
//{
//	int a[5] = {1, 2, 3, 4, 5};
//	int *ptr = (int *)(&a + 1);
//	//&a取出的是数组的地址,数组地址放在数组指针中,它的类型是int(*)[5],所以前面有强制类型转换
//	printf("%d,%d", *(a + 1), *(ptr - 1));
//	return 0;
//}

struct Test
{
	int Num;
	char *pcName;
	short sDate;
	char cha[2];
	short sBa[4];
} *p = (struct Test *)0x100000;

// 假设p 的值是0x100000.如下表表达式的值分别是多少
// 已知,结构体Test类型的变量大小是20字节
// x86
//
// int main()
//{
//	printf("%p\n", p + 0x1);
//	//结构体指针 +1 跳过一个结构体 0x100014
//	printf("%p\n", (unsigned long)p + 0x1);//0x100001
//	printf("%p\n", (unsigned int*)p + 0x1);//0x100004
//	return 0;
// }

//
// int main()
//{
//	int a[3][2] = { (0,1),(2,3),(4,5) };
//	//在c/c++中,圆括号内的逗号不是分隔符,而是逗号运算符,逗号运算符会依次计算每个表达式,并返回最后一个
//	// 表达式的值
//	// (0,1) --> 值为 1
//	// (2,3) --> 值为 3
//	// (4,5) --> 值为5
//	// 所以上面的数组初始化后相当于int a[3][2] = {1,3,5};
//	// 不够后面自动补0
//	//int a[3][2] = { {0,1},{2,3},{4,5} };
//	int* p;
//	p = a[0];
//	printf("%d", p[0]);
//	return 0;
//}

//
// int main()
//{
//	int aa[2][5] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* ptr1 = (int*)(&aa + 1);
//	int* ptr2 = (int*)(*(aa + 1));
//	printf("%d,%d", *(ptr1 - 1), *(ptr2 - 1));//10,5
//	return 0;
//}

// int main()
// {
// 	int a[5][5];
// 	int (*p)[4];
// 	p = a;
// 	// 这里p的类型是int (*)[4],a是数组首元素的地址,也就是第一行的地址,所以a的类型是int (*)[5]
// 	// 所以这里把a赋值给p会发生两者所指向的元素个数不同的问题
// 	printf("%p,%d\n", &p[4][2] - &a[4][2], &p[4][2] - &a[4][2]);
// 	// 指针-指针得到的是元素的个数
// 	// 随着数组下标的增长,地址是由低到高变化的
// 	//&p[4][2] - &a[4][2] = -4
// 	//%d -- 按照十进制的形式,打印有符号的整数,他认为内存中存放的是有符号整数的补码,打印的是原码
// 	//%p -- 打印地址的,认为内存中存放的补码就是地址
// 	//-4
// 	// 10000000 00000000 00000000 00000100   原码
// 	// 11111111 11111111 11111111 11111011   反码
// 	// 11111111 11111111 11111111 11111100   补码
// 	// 0xFFFFFFFC
// 	return 0;
// }

// int main()
// {
// 	char *a[] = {"work", "at", "alibaba"};
// 	char **pa = a;

// 	pa++;
// 	printf("%s\n", *pa); //

// 	return 0;
// }
//
//int main()
//{
//	char* c[] = { "ENTER", "NEW", "POINT", "FIRST" };
//	char** cp[] = { c + 3, c + 2, c + 1, c };
//	char*** cpp = cp;
//
//	printf("%s\n", **++cpp);
//	printf("%s\n", *-- * ++cpp + 3);
//	printf("%s\n", *cpp[-2] + 3);
//	printf("%s\n", cpp[-1][-1] + 1);
//
//	return 0;
//}


